rtm_intro.org
#+TITLE: Reaction Diffusion Models - A Practical Introduction
#+AUTHOR:Ulrich G. Wortmann
#+STARTUP: showall latexpreview shrink inlineimages
#+OPTIONS: todo:nil tasks:nil tags:nil toc:nil
#+org-latex-compiler: xelatex
#+LATEX_CLASS: koma-article
#+latex_class_options: [11pt,letter]
#+latex_header: \newlength\bibitemsep
#+latex_header: \hypersetup{colorlinks=true,linkcolor=Navy,filecolor=Navy,urlcolor=Navy,citecolor=Navy,anchorcolor=Navy}

#+latex: \maketitle

* A short Jupyter Notebook Introduction 
A notebook is a web‑based document that mixes *code*, *text*, *plots*, and *data*. The building blocks are *cells*. Below is a quick guide to creating, editing, and running code cells.


** The Notebook Interface

- Toolbar ::  Buttons for saving, adding cells, cutting/pasting, etc.  
- Menu bar :: More commands (File → Download, Cell → Run…, etc.)
-  Cells :: Individual blocks that hold code or markdown text.  
- Kernel :: The Python (or other language) process that executes your code.

** Adding a Code Cell
1. *Click* the *=+=* button on the toolbar *or* press *=Esc=* then *=B=* (below) / *=A=* (above) to insert a new cell.  
2. By default the new cell is a *code cell* (green border).  


**  Editing a Code Cell
- *Enter edit mode* – click inside the cell *or* press *=Enter=* when the cell is selected.  
- The cell border turns *green* and you can type Python (or the kernel’s language).  
- Use normal editor shortcuts (Ctrl‑A to select all, Ctrl‑Z to undo, etc.).  



**  Running a Code Cell
- | Run the current cell and move to the next  *Shift + Enter*  Executes the cell, shows output below, and selects the cell below (or creates a new one if you’re at the end).
- Run the current cell and stay  *Ctrl + Enter*  Executes the cell but keeps the cursor in the same cell.
- Run the current cell and insert a new one below  *Alt + Enter* Executes, then adds a fresh cell underneath. 

/When you run a cell, the kernel prints the result (e.g., numbers, plots, tables) right under the cell. If there’s an error, the traceback appears there too./

Try it right here:
#+BEGIN_SRC jupyter-python
23 + 3
#+END_SRC


**  Common Editing Shortcuts (while in *command mode*, =Esc=)

- =A= :: Insert a new cell *above* the selected cell
- =B= :: Insert a new cell *below* 
- =D= =D= (press =D= twice) :: Delete the selected cell
- =M= :: Change selected cell to *Markdown* (for formatted text)
- =Y= ::  Change selected cell back to *Code*
- =↑= / =↓= ::  Move selection up/down
- =Shift= =↑= =↓= Extend selection to multiple cells
- =Ctrl= =S=  :: Save notebook (also click the floppy‑disk icon) 

/Tip:/ Press =Esc= to ensure you’re in *command mode* (blue border) before using these shortcuts.



** Saving & Exporting
- Click the *disk* icon or press *Ctrl + S* frequently.  
- When finished, you can download the notebook as =.ipynb= (File → Download as → Notebook) or as a static HTML/PDF for sharing.


** Quick Checklist for First‑Time Users
1. *Add* a code cell (=+= or =B=).  
2. *Type* some Python, e.g. =print("Hello, Jupyter!")=.  
3. *Run* it with *Shift + Enter*.  
4. *Observe* the output below.  
5. *Edit* any cell by clicking into it and pressing *Enter*.  
6. *Save* often (=Ctrl + S=).  

That’s it! With these basics you can start experimenting, visualizing data, and building interactive analyses—all within the same notebook. Happy coding!

See this link https://www.youtube.com/watch?v=H9Iu49E6Mxs for a more complete intro.

** Checkpoints
Checkpoints allow you to return to a previous version of your notebook. 
- *Manually creating a checkpoint*  
  1. Click *File → Save and Checkpoint* (or press =Ctrl + S=).  
  2. The current notebook becomes the new checkpoint.

- *Reverting to a checkpoint*  
  1. Choose *File → Revert to Checkpoint → <timestamp>*.  
  2. Jupyter overwrites the notebook with the saved copy.  
  3. The notebook shows a banner “Reverted to checkpoint”.

It is a good idea to frequently press =Ctrl +S=!

*** Try me! 
- Create a new checkpoint 
- Create a new code cell, and type a something like =12 *5=
- execute the code cell to see the result.
- revert to the previous checkpoint 



* Preparing your python session 
Before we begin, we need to install some python modules. 
** Installing the python modules needed in this session 
You need to execute this once per session 
#+BEGIN_SRC jupyter-python
%pip install fastfd
#+END_SRC

** Import the model and the plotting interface 
We now load the following modules:

| Module | Purpose |
|--------|---------|
| =matplotlib.pyplot= | Create static, animated, and interactive figures. |
| =pandas= | Manipulate tabular data (DataFrames). |
| =diff_lib.data_container= | Wrap raw simulation output into a convenient object. |
| =run_methane.model= | Run the methane diffusion model. |

#+BEGIN_SRC jupyter-python
import matplotlib.pyplot as plt
import pandas as pd
from diff_lib import data_container 
from run_methane import model
#+END_SRC


* Defining the first model: 
The model we employ is derived from a more comprehensive reaction-transport model used in my research. It is not designed for a Jupyter session, so the user interface is somewhat awkward. Most parameters are defined using Python dictionaries that contain key-value pairs. The key is enclosed in quotation marks; the value may be (i) a bare word, interpreted as the name of a variable, (ii) a quoted string, interpreted verbatim, or (iii) a numeric value.

A common source of error in modeling is inconsistent units. Therefore I run all my models in SI base units - meters, seconds, and concentrations expressed in mmol/l. First we have to define a the length of the model, the number of grid points, the porosity, and sedimentation rate. Before continuing, convert the sedimentation value into meters/ky to see if the value make sense:

You can do this easily on a pocket calculator, or by typing the calculation in this notebook cell (see above on how to edit, and execute a cell): Note that =1e-5= stands for 1 \times 10^{-5}.
#+BEGIN_SRC jupyter-python
12 *5
#+END_SRC

Next we need to execute this code block to activate these numbers. You can always come back later to to change them (Note, changes affect the entire notebook!).
#+BEGIN_SRC jupyter-python
# a few parameters to play with
p = {
    "max_depth": 0.35,  # meters
    "grid_points": 350,
    "phi": 0.65,  # porosity
    "w": 1.5e-10,  # sedimentation rate in m/s
}
#+END_SRC

