rtm_intro.tex
% Created 2025-11-27 Thu 11:01
% Intended LaTeX compiler: pdflatex
\documentclass[11pt,letter]{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage{soul}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage[svgnames]{xcolor}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{natbib}
\usepackage{natmove}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{booktabs}
\usepackage[theorems, skins]{tcolorbox}
\usepackage[version=4]{mhchem}
\usepackage{url}
\usepackage{array}
\usepackage[cache=false]{minted}
\usepackage[strings]{underscore}
\usepackage{hyperref}
\newlength\bibitemsep
\hypersetup{colorlinks=true,linkcolor=Navy,filecolor=Navy,urlcolor=Navy,citecolor=Navy,anchorcolor=Navy}
\author{Ulrich G. Wortmann}
\date{\today}
\title{Reaction Diffusion Models - A Practical Introduction}
\begin{document}

\maketitle
\section{A short Jupyter Notebook Introduction}
\label{sec:orgafe34a2}
A notebook is a web‑based document that mixes \textbf{code}, \textbf{text}, \textbf{plots}, and \textbf{data}. The building blocks are \textbf{cells}. Below is a quick guide to creating, editing, and running code cells.
\subsection{The Notebook Interface}
\label{sec:org92a74cf}

\begin{description}
\item[{Toolbar}] Buttons for saving, adding cells, cutting/pasting, etc.
\item[{Menu bar}] More commands (File → Download, Cell → Run…, etc.)
\item[{Cells}] Individual blocks that hold code or markdown text.
\item[{Kernel}] The Python (or other language) process that executes your code.
\end{description}
\subsection{Adding a Code Cell}
\label{sec:org25be650}
\begin{enumerate}
\item \textbf{Click} the \textbf{\texttt{+}} button on the toolbar \textbf{or} press \textbf{\texttt{Esc}} then \textbf{\texttt{B}} (below) / \textbf{\texttt{A}} (above) to insert a new cell.
\item By default the new cell is a \textbf{code cell} (green border).
\end{enumerate}
\subsection{Editing a Code Cell}
\label{sec:org2d26e58}
\begin{itemize}
\item \textbf{Enter edit mode} – click inside the cell \textbf{or} press \textbf{\texttt{Enter}} when the cell is selected.
\item The cell border turns \textbf{green} and you can type Python (or the kernel’s language).
\item Use normal editor shortcuts (Ctrl‑A to select all, Ctrl‑Z to undo, etc.).
\end{itemize}
\subsection{Running a Code Cell}
\label{sec:org5b0065f}
\begin{itemize}
\item | Run the current cell and move to the next  \textbf{Shift + Enter}  Executes the cell, shows output below, and selects the cell below (or creates a new one if you’re at the end).
\item Run the current cell and stay  \textbf{Ctrl + Enter}  Executes the cell but keeps the cursor in the same cell.
\item Run the current cell and insert a new one below  \textbf{Alt + Enter} Executes, then adds a fresh cell underneath.
\end{itemize}

\emph{When you run a cell, the kernel prints the result (e.g., numbers, plots, tables) right under the cell. If there’s an error, the traceback appears there too.}
\subsection{Common Editing Shortcuts (while in \textbf{command mode}, \texttt{Esc})}
\label{sec:org4b70a26}

\begin{description}
\item[{\texttt{A}}] Insert a new cell \textbf{above} the selected cell
\item[{\texttt{B}}] Insert a new cell \textbf{below}
\item[{\texttt{D} \texttt{D} (press \texttt{D} twice)}] Delete the selected cell
\item[{\texttt{M}}] Change selected cell to \textbf{Markdown} (for formatted text)
\item[{\texttt{Y}}] Change selected cell back to \textbf{Code}
\item[{\texttt{↑} / \texttt{↓}}] Move selection up/down
\item \texttt{Shift} \texttt{↑} \texttt{↓} Extend selection to multiple cells
\item[{\texttt{Ctrl} \texttt{S} }] Save notebook (also click the floppy‑disk icon)
\end{description}

\emph{Tip:} Press \texttt{Esc} to ensure you’re in \textbf{command mode} (blue border) before using these shortcuts.
\subsection{Saving \& Exporting}
\label{sec:orga9e1f48}
\begin{itemize}
\item Click the \textbf{disk} icon or press \textbf{Ctrl + S} frequently.
\item When finished, you can download the notebook as \texttt{.ipynb} (File → Download as → Notebook) or as a static HTML/PDF for sharing.
\end{itemize}
\subsection{Quick Checklist for First‑Time Users}
\label{sec:orged0df3b}
\begin{enumerate}
\item \textbf{Add} a code cell (\texttt{+} or \texttt{B}).
\item \textbf{Type} some Python, e.g. \texttt{print("Hello, Jupyter!")}.
\item \textbf{Run} it with \textbf{Shift + Enter}.
\item \textbf{Observe} the output below.
\item \textbf{Edit} any cell by clicking into it and pressing \textbf{Enter}.
\item \textbf{Save} often (\texttt{Ctrl + S}).
\end{enumerate}

That’s it! With these basics you can start experimenting, visualizing data, and building interactive analyses—all within the same notebook. Happy coding!

See this link \url{https://www.youtube.com/watch?v=H9Iu49E6Mxs} for a more complete intro.
\subsection{Checkpoints}
\label{sec:org06811cf}
Checkpoints allow you to return to a previous version of your notebook. 
\begin{itemize}
\item \textbf{Manually creating a checkpoint}  
\begin{enumerate}
\item Click \textbf{File → Save and Checkpoint} (or press \texttt{Ctrl + S}).
\item The current notebook becomes the new checkpoint.
\end{enumerate}

\item \textbf{Reverting to a checkpoint}  
\begin{enumerate}
\item Choose \textbf{File → Revert to Checkpoint → <timestamp>}.
\item Jupyter overwrites the notebook with the saved copy.
\item The notebook shows a banner “Reverted to checkpoint”.
\end{enumerate}
\end{itemize}

It is a good idea to frequently press \texttt{Ctrl +S}!
\subsubsection{Try me!}
\label{sec:org417e5b4}
\begin{itemize}
\item Create a new checkpoint
\item Create a new code cell, and type a something like \texttt{12 *5}
\item execute the code cell to see the result.
\item revert to the previous checkpoint
\end{itemize}
\section{Preparing your python session}
\label{sec:orgb72137b}
Before we begin, we need to install some python modules. 
\subsection{Installing the python modules needed in this session}
\label{sec:orgba5715b}
You need to execute this once per session 
\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
%pip install fastfd
\end{minted}
\subsection{Import the model and the plotting interface}
\label{sec:orga94379f}
We now load the following modules:

\begin{center}
\begin{tabular}{ll}
Module & Purpose\\
\hline
\texttt{matplotlib.pyplot} & Create static, animated, and interactive figures.\\
\texttt{pandas} & Manipulate tabular data (DataFrames).\\
\texttt{diff\_lib.data\_container} & Wrap raw simulation output into a convenient object.\\
\texttt{run\_methane.model} & Run the methane diffusion model.\\
\end{tabular}

\end{center}

\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
import matplotlib.pyplot as plt
import pandas as pd
from diff_lib import data_container 
from run_methane import model
\end{minted}
\section{Defining the first model:}
\label{sec:org1aad9d4}
The model we employ is derived from a more comprehensive reaction-transport model used in my research. It is not designed for a Jupyter session, so the user interface is somewhat awkward. Most parameters are defined using Python dictionaries that contain key-value pairs. The key is enclosed in quotation marks; the value may be (i) a bare word, interpreted as the name of a variable, (ii) a quoted string, interpreted verbatim, or (iii) a numeric value.

A common source of error in modeling is inconsistent units. Therefore I run all my models in SI base units - meters, seconds, and concentrations expressed in mmol/l. First we have to define a the length of the model, the number of grid points, the porosity, and sedimentation rate. Before continuing, convert the sedimentation value into meters/ky to see if the value make sense:

You can do this easily on a pocket calculator, or by typing the calculation in this notebook cell (see above on how to edit, and execute a cell): Note that \texttt{1e-5} stands for 1 \texttimes{} 10\textsuperscript{-5}.
\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
12 *5
\end{minted}

Next we need to execute this code block to activate these numbers. You can always come back later to to change them (Note, changes affect the entire notebook!).
\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
# a few parameters to play with
p = {
    "max_depth": 0.35,  # meters
    "grid_points": 350,
    "phi": 0.65,  # porosity
    "w": 1.5e-10,  # sedimentation rate in m/s
}
\end{minted}
