rtm_intro.tex
\subsection{Setting boundary conditions}
\label{sec:orgc72a646}
Setting the boundary conditions requires choosing a specification method and assigning appropriate values. For diffusive and advective transport we can use three types of boundary conditions:

\begin{enumerate}
\item \textbf{Dirichlet} (infinite concentration) – the concentration at the boundary is fixed. For example, the sulfate concentration in seawater remains \(28\ \mathrm{mmol\;L^{-1}}\) regardless of reactions in the underlying sediment.
\item \textbf{Neumann} – the concentration is unknown but its gradient is zero. This represents a depth where diagenetic reactions have ceased.
\item \textbf{Robin} – a mixture of Dirichlet and Neumann. The flux is proportional to the difference between the boundary value and the ambient value.
\end{enumerate}

We will use the following concentration values as upper and lower bounds for our first model.
\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
bc = {
    "ch4": [  # species
        "concentration",  # upper bc type
        0,  # upper bc value
        "concentration",  # lower bc type
        0.3,  # lower bc value
        "dissolved",  # phase
        1,  # reaction type 1 = source, -1 = sink
    ],
}
\end{minted}
\subsection{Define reaction rates and a reaction term}
\label{sec:orgc497349}
For the initial run we use a simple model with no microbial reactions; all reaction terms are set to zero. Although we consider only one species, the code requires a reaction constant for every species.
\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
# --------------------------- Reaction constants ------------ *
k = data_container({"ch4": 0})
\end{minted}

Furthermore, I provide a function that describes which entities react with which and how. Because there is no reaction, the function returns 0.
\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
def diagenetic_reactions(a, z, c, k, f):
        """Define microbial reactions. Note that reactions
        are always positive. The sign is set by reaction type
        which can be either a 'source' or a 'sink'
        """
        f.ch4 = 0

        return f, 0
\end{minted}
\subsection{Run the model and plot the results}
\label{sec:orgc769f23}
Now I am ready to run the model. I call the model code with the parameter list \texttt{p}, the boundary conditions \texttt{bc}, the reaction rates \texttt{k}, and the function that describes the diagenetic reactions. The model returns a data frame \texttt{df} with all results.
\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
df = model(p, bc, k, diagenetic_reactions)
display(df.head())
\end{minted}

Next, I create an X‑Y graph from the dataframe with this code snippet.
\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
fig, ax = plt.subplots() # Create a new plot object 
ax.plot(df.c_ch4, df.z) # assign data to X & Y axes 
ax.set_xlabel(r"CH$_4$ [mmol/l]") # set labels 
ax.set_ylabel("Depth [mbsf]")
ax.invert_yaxis() 
fig.tight_layout()
plt.show()
\end{minted}
BTW, If you feel adventurous, create a checkpoint and edit the above code by dividing the z-coordinate by 10 (\texttt{df.z/10})m and change the y-label to cm.
\subsection{Now what does this all mean?}
\label{sec:orgaf24cda}
At first sight the results appear trivial, but there are hidden difficulties. By imposing a concentration boundary condition (\emph{Dirichlet} type) we explicitly assume that both the upper and lower boundaries are infinite; that is, the boundary values remain fixed regardless of what happens inside the model. This assumption is often reasonable for the upper boundary, but it is much harder to justify for the lower boundary. In the present example we are effectively stating that there is an infinite supply of methane at the base of the core, which is unlikely to be realistic. And in the absence of any reactions, we get a straight line as we would expect for diffusive mixing.

We could try to resort to a  \emph{Neuman} boundary condition where, instead of  concentration, we state that there should be no change in concentration, i.e., the gradient of the concentration equals zero. This way we assume that there are no further changes in [CH\textsubscript{4}] but now, because there is no methane source below our modeling domain (equally unlikely), and we get no methane at all. 
\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
bc = {
    "ch4": [  # species
        "concentration",  # upper bc type
        0,  # upper bc value
        "gradient",  # lower bc type
        0,  # lower bc value
        "dissolved",  # phase
        -1,  # reaction type -1 = source, 1 = sink
    ],
}

df = model(p, bc, k, diagenetic_reactions)
fig, ax = plt.subplots() # Create a new plot object 
ax.plot(df.c_ch4, df.z) # assign data to X & Y axes 
ax.set_xlabel(r"CH$_4$ [mmol/l]") # set labels 
ax.set_ylabel("Depth [mbsf]")
ax.invert_yaxis() 
fig.tight_layout()
plt.show()
\end{minted}

So a key observation is that the boundary conditions determine the model results to a large degree. 
\section{Adding a methane production term}
\label{sec:org1eea7e4}
Microbial reactions often decay with time (depth), but for the sake of simplicity, we will assume a constant reaction term. We do this by modifying the \texttt{diagenetic\_reactions} function, and then re-running the model. 
\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
def diagenetic_reactions(a, z, c, k, f):
      f.ch4 = 1e-8  #mmol/l/s
      return f, 0

df = model(p, bc, k, diagenetic_reactions)
fig, ax = plt.subplots() # Create a new plot object 
ax.plot(df.c_ch4, df.z) # assign data to X & Y axes 
ax.set_xlabel(r"CH$_4$ [mmol/l]") # set labels 
ax.set_ylabel("Depth [mbsf]")
ax.invert_yaxis() 
fig.tight_layout()
plt.show()
\end{minted}
This now looks much better, but there are two issues here:
\begin{enumerate}
\item the curve bends much earlier than in the Angel et al. paper (something we can try to fix by changing the methane production term)
\item Our curve is artificially forced to be vertical. This is in clear violation of the fact that we produce methane at the bottom of the model.
\end{enumerate}

Now go back to the Angle et al paper, and compare their methane production rate with the above number. You can use this code box for the calculation:
\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
12 * 5
\end{minted}
\section{A better model}
\label{sec:orgcee3a40}
To avoid the bias introduced by our boundary conditions, we need to extend the modeling domain into a region where we are certain that no methane production occurs, so that the assumption of a zero gradient in [CH\textsubscript{4}] is justified. Therefore, we assume that methane production ceases in the last 5 cm above the bottom of the core.
\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
def diagenetic_reactions(a, z, c, k, f):
      f.ch4[:] = 1e-8  #mmol/s # treat ch4 a vector
      f.ch4[300:] = 0 # set the last 5 cms to zero

      return f, 0

# run model
df = model(p, bc, k, diagenetic_reactions)

# plot data
fig, ax = plt.subplots() # Create a new plot object
ax.plot(df.c_ch4, df.z) # assign data to X & Y axes
ax.set_xlabel(r"CH$_4$ [mmol/l]") # set labels
ax.set_ylabel("Depth [mbsf]")
ax.invert_yaxis()

# plot f to verify
axt = ax.twiny()
axt.plot(df.f_ch4, df.z, color="C1")
axt.set_xlabel("f [mmol/s]")
fig.tight_layout()
plt.show()
\end{minted}
\section{The problem with advection}
\label{sec:orgae56c86}
Advection comes in two flavors:
\begin{enumerate}
\item Downward directed sedimentation creates a constant downward flux. This affects dissolved ions as well as solids. Fast sedimentation rates are able to distort the linear mixing profiles into a concave shape.
\item Upward directed fluid flow. This only affects solutes, but not particles.
\end{enumerate}

This model has presently no support for the second type, but since we have no particles in our model, we can simply change the sign of the sedimentation rate to emulate the effect. 
