rtm_intro.tex
\subsection{Case A: Sedimentation rate is fast compared to the microbial  reactions.}
\label{sec:org79f80ae}
This is an unrealistic scenario but serves to show how sedimentation rate affects concentration profiles
\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
# a few parameters to play with
p = {
       "w": 1.5e-9,  # sedimentation rate in m/s
}

df = model(p, bc, k, diagenetic_reactions)

fig, ax = plt.subplots() # Create a new plot object
ax.plot(df.c_ch4, df.z) # assign data to X & Y axes
ax.set_xlabel(r"CH$_4$ [mmol/l]") # set labels
ax.set_ylabel("Depth [mbsf]")
ax.invert_yaxis()
fig.tight_layout()
plt.show()
\end{minted}
\subsection{Case B: Upward directed fluid flow}
\label{sec:org7f437fc}
To emulate the effect of upward directed fluid flow, we simply change the sign for the sedimentation rate (this is only valid if there are no solids in the model!)
\begin{minted}[fontsize=\small,frame=lines,linenos]{python}
# a few parameters to play with
p = {
       "w": -1.5e-9,  # sedimentation rate in m/s
}

df = model(p, bc, k, diagenetic_reactions)

fig, ax = plt.subplots() # Create a new plot object
ax.plot(df.c_ch4, df.z) # assign data to X & Y axes
ax.set_xlabel(r"CH$_4$ [mmol/l]") # set labels
ax.set_ylabel("Depth [mbsf]")
ax.invert_yaxis()
fig.tight_layout()
plt.show()
\end{minted}
It is evident, that sedimentation/advection has a huge influence on concentration profiles. A specific problems for wetlands that are exposed to episodic flooding, or tidal cycles.
\end{document}
